Conf.Simple/src/InformationRegisters/SUI_КешПакетовДанных/SUI_КешПакетовДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_КешПакетовДанных</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторПакета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_КешПакетовДанных/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СоздатьОбновитьПакет(МобильноеУстройство, Знач Данные = Неопределено, СохранитьКакJSON = Истина) Экспорт 
	
	Попытка
		
		ИдентификаторПакета = Строка(Новый УникальныйИдентификатор());
		
		Если СохранитьКакJSON Тогда  
			Если ТипЗнч(Данные) <> Тип("ДвоичныеДанные") Тогда 
				Данные = ПолучитьДвоичныеДанныеИзСтроки(Данные);
			КонецЕсли;
		КонецЕсли;

		Запись = СоздатьМенеджерЗаписи();
		
		Запись.МобильноеУстройство 	= МобильноеУстройство;
		Запись.ИдентификаторПакета 	= ИдентификаторПакета;
		Запись.Данные 				= Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(9));
        Запись.Период = ТекущаяДата();
		Запись.Записать(Истина);
				
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(НСтр("ru = 'Пакеты данных'"),,, МобильноеУстройство, ИнформацияОбОшибке());
		ВызватьИсключение КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат ИдентификаторПакета;
	
КонецФункции   

//@skip-check method-too-many-params
//@skip-check doc-comment-parameter-section
//@skip-check doc-comment-export-function-return-section
Функция ПолучитьПакет(МобильноеУстройство, Идентификатор = Неопределено, 
	ПолучитьКакJSON = Истина, УдалитьПакет = Истина, ИдентификаторЗадания = Неопределено) Экспорт 
	
	Данные = Новый Структура("ОстатокПакетов, ДанныеПакета, ЕстьПакеты", 0,,Ложь);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Если ТипЗнч(Идентификатор) = Тип("Строка") И SUI_СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Идентификатор) Тогда
		Запрос.УстановитьПараметр("ИдентификаторПакета", Идентификатор);
	Иначе
		Запрос.УстановитьПараметр("ИдентификаторПакета", Неопределено);
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|			КОЛИЧЕСТВО(*) КАК КоличествоПакетов
	|		ИЗ
	|			РегистрСведений.SUI_КешПакетовДанных КАК SUI_КешПакетовДанных
	|		ГДЕ
	|			SUI_КешПакетовДанных.МобильноеУстройство = &МобильноеУстройство
	|		;
	|		
	|		////////////////////////////////////////////////////////////////////////////////
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			SUI_КешПакетовДанных.МобильноеУстройство КАК МобильноеУстройство,
	|			SUI_КешПакетовДанных.ИдентификаторПакета КАК ИдентификаторПакета,
	|			SUI_КешПакетовДанных.Данные КАК Данные
	|		ИЗ
	|			РегистрСведений.SUI_КешПакетовДанных КАК SUI_КешПакетовДанных
	|		ГДЕ
	|			SUI_КешПакетовДанных.МобильноеУстройство = &МобильноеУстройство";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();

	Выборка = РезультатЗапроса[0].Выбрать();
	Выборка.Следующий();
	
	Данные.ОстатокПакетов = Выборка.КоличествоПакетов;
	
	Если Выборка.КоличествоПакетов > 0 И Не РезультатЗапроса[1].Пустой() Тогда
		
		Выборка = РезультатЗапроса[1].Выбрать();
		Выборка.Следующий();
		
		Данные.ДанныеПакета = Выборка.Данные.Получить();
		
		Если Данные.ДанныеПакета <> Неопределено И Не ПолучитьКакJSON Тогда
			
			Если ТипЗнч(Данные.ДанныеПакета) = Тип("ДвоичныеДанные") Тогда
				Данные.ДанныеПакета = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(
					ПолучитьСтрокуИзДвоичныхДанных(Данные.ДанныеПакета), Ложь);
			КонецЕсли;

		КонецЕсли;
		
		Если УдалитьПакет Тогда
			УдалитьПакет(Выборка.МобильноеУстройство, Выборка.ИдентификаторПакета);
		КонецЕсли;		
		
		Данные.ОстатокПакетов = Данные.ОстатокПакетов - 1;
		Данные.ЕстьПакеты = Истина;
	КонецЕсли;  

	Возврат Данные;
	
КонецФункции

Процедура УдалитьПакет(МобильноеУстройство, ИдентификаторПакета = Неопределено) Экспорт 
		
	Попытка

		НаборЗаписей = СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.МобильноеУстройство.Установить(МобильноеУстройство);
		
		Если ТипЗнч(ИдентификаторПакета) = Тип("Строка") И 
			SUI_СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИдентификаторПакета) Тогда
			НаборЗаписей.Отбор.ИдентификаторПакета.Установить(ИдентификаторПакета); 
		КонецЕсли;  
		
		
		НаборЗаписей.Прочитать();
		
		Для Каждого Запись Из НаборЗаписей Цикл
			
			НовыйНаборЗаписей = СоздатьНаборЗаписей();
			
			НовыйНаборЗаписей.Отбор.МобильноеУстройство.Установить(Запись.МобильноеУстройство);
			НовыйНаборЗаписей.Отбор.ИдентификаторПакета.Установить(Запись.ИдентификаторПакета);
			
		КонецЦикла;
		
		НаборЗаписей.Очистить();
		
		НаборЗаписей.Записать(Истина);
		
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(НСтр("ru = 'Пакеты данных'"),,, МобильноеУстройство, ИнформацияОбОшибке());
		ВызватьИсключение КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
